MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV32GM106/mcu.h
#define _C1RXM0SID_EID17_POSITION                0x00000001
#define _C1RXM0SID_EID17_MASK                    0x00000002
#define _C1RXM0SID_EID17_LENGTH                  0x00000001

#define _C1RXM0SID_MIDE_POSITION                 0x00000003
#define _C1RXM0SID_MIDE_MASK                     0x00000008
#define _C1RXM0SID_MIDE_LENGTH                   0x00000001

#define _C1RXM0SID_SID0_POSITION                 0x00000005
#define _C1RXM0SID_SID0_MASK                     0x00000020
#define _C1RXM0SID_SID0_LENGTH                   0x00000001

#define _C1RXM0SID_SID1_POSITION                 0x00000006
#define _C1RXM0SID_SID1_MASK                     0x00000040
#define _C1RXM0SID_SID1_LENGTH                   0x00000001

#define _C1RXM0SID_SID2_POSITION                 0x00000007
#define _C1RXM0SID_SID2_MASK                     0x00000080
#define _C1RXM0SID_SID2_LENGTH                   0x00000001

#define _C1RXM0SID_SID3_POSITION                 0x00000008
#define _C1RXM0SID_SID3_MASK                     0x00000100
#define _C1RXM0SID_SID3_LENGTH                   0x00000001

#define _C1RXM0SID_SID4_POSITION                 0x00000009
#define _C1RXM0SID_SID4_MASK                     0x00000200
#define _C1RXM0SID_SID4_LENGTH                   0x00000001

#define _C1RXM0SID_SID5_POSITION                 0x0000000A
#define _C1RXM0SID_SID5_MASK                     0x00000400
#define _C1RXM0SID_SID5_LENGTH                   0x00000001

#define _C1RXM0SID_SID6_POSITION                 0x0000000B
#define _C1RXM0SID_SID6_MASK                     0x00000800
#define _C1RXM0SID_SID6_LENGTH                   0x00000001

#define _C1RXM0SID_SID7_POSITION                 0x0000000C
#define _C1RXM0SID_SID7_MASK                     0x00001000
#define _C1RXM0SID_SID7_LENGTH                   0x00000001

#define _C1RXM0SID_SID8_POSITION                 0x0000000D
#define _C1RXM0SID_SID8_MASK                     0x00002000
#define _C1RXM0SID_SID8_LENGTH                   0x00000001

#define _C1RXM0SID_SID9_POSITION                 0x0000000E
#define _C1RXM0SID_SID9_MASK                     0x00004000
#define _C1RXM0SID_SID9_LENGTH                   0x00000001

#define _C1RXM0SID_SID10_POSITION                0x0000000F
#define _C1RXM0SID_SID10_MASK                    0x00008000
#define _C1RXM0SID_SID10_LENGTH                  0x00000001

#define _C1RXM0SID_EID_POSITION                  0x00000000
#define _C1RXM0SID_EID_MASK                      0x00000003
#define _C1RXM0SID_EID_LENGTH                    0x00000002

#define _C1RXM0SID_EXIDE_POSITION                0x00000003
#define _C1RXM0SID_EXIDE_MASK                    0x00000008
#define _C1RXM0SID_EXIDE_LENGTH                  0x00000001

#define _C1RXM0SID_SID_POSITION                  0x00000005
#define _C1RXM0SID_SID_MASK                      0x0000FFE0
#define _C1RXM0SID_SID_LENGTH                    0x0000000B

#define _C1TR01CON_TX0PRI_POSITION               0x00000000
#define _C1TR01CON_TX0PRI_MASK                   0x00000003
#define _C1TR01CON_TX0PRI_LENGTH                 0x00000002

#define _C1TR01CON_RTREN0_POSITION               0x00000002
#define _C1TR01CON_RTREN0_MASK                   0x00000004
#define _C1TR01CON_RTREN0_LENGTH                 0x00000001

#define _C1TR01CON_TXREQ0_POSITION               0x00000003
#define _C1TR01CON_TXREQ0_MASK                   0x00000008
#define _C1TR01CON_TXREQ0_LENGTH                 0x00000001

#define _C1TR01CON_TXERR0_POSITION               0x00000004
#define _C1TR01CON_TXERR0_MASK                   0x00000010
#define _C1TR01CON_TXERR0_LENGTH                 0x00000001

#define _C1TR01CON_TXLARB0_POSITION              0x00000005
#define _C1TR01CON_TXLARB0_MASK                  0x00000020
#define _C1TR01CON_TXLARB0_LENGTH                0x00000001

#define _C1TR01CON_TXABT0_POSITION               0x00000006
#define _C1TR01CON_TXABT0_MASK                   0x00000040
#define _C1TR01CON_TXABT0_LENGTH                 0x00000001

#define _C1TR01CON_TXEN0_POSITION                0x00000007
#define _C1TR01CON_TXEN0_MASK                    0x00000080
#define _C1TR01CON_TXEN0_LENGTH                  0x00000001

#define _C1TR01CON_TX1PRI_POSITION               0x00000008
#define _C1TR01CON_TX1PRI_MASK                   0x00000300
#define _C1TR01CON_TX1PRI_LENGTH                 0x00000002

#define _C1TR01CON_RTREN1_POSITION               0x0000000A
#define _C1TR01CON_RTREN1_MASK                   0x00000400
#define _C1TR01CON_RTREN1_LENGTH                 0x00000001

#define _C1TR01CON_TXREQ1_POSITION               0x0000000B
#define _C1TR01CON_TXREQ1_MASK                   0x00000800
#define _C1TR01CON_TXREQ1_LENGTH                 0x00000001

#define _C1TR01CON_TXERR1_POSITION               0x0000000C
#define _C1TR01CON_TXERR1_MASK                   0x00001000
#define _C1TR01CON_TXERR1_LENGTH                 0x00000001

#define _C1TR01CON_TXLARB1_POSITION              0x0000000D
#define _C1TR01CON_TXLARB1_MASK                  0x00002000
#define _C1TR01CON_TXLARB1_LENGTH                0x00000001

#define _C1TR01CON_TXABT1_POSITION               0x0000000E
#define _C1TR01CON_TXABT1_MASK                   0x00004000
#define _C1TR01CON_TXABT1_LENGTH                 0x00000001

#define _C1TR01CON_TXEN1_POSITION                0x0000000F
#define _C1TR01CON_TXEN1_MASK                    0x00008000
#define _C1TR01CON_TXEN1_LENGTH                  0x00000001

#define _C1TR01CON_TX0PRI0_POSITION              0x00000000
#define _C1TR01CON_TX0PRI0_MASK                  0x00000001
#define _C1TR01CON_TX0PRI0_LENGTH                0x00000001

#define _C1TR01CON_TX0PRI1_POSITION              0x00000001
#define _C1TR01CON_TX0PRI1_MASK                  0x00000002
#define _C1TR01CON_TX0PRI1_LENGTH                0x00000001

#define _C1TR01CON_TX1PRI0_POSITION              0x00000008
#define _C1TR01CON_TX1PRI0_MASK                  0x00000100
#define _C1TR01CON_TX1PRI0_LENGTH                0x00000001

#define _C1TR01CON_TX1PRI1_POSITION              0x00000009
#define _C1TR01CON_TX1PRI1_MASK                  0x00000200
#define _C1TR01CON_TX1PRI1_LENGTH                0x00000001

#define _C1RXM0EID_EID0_POSITION                 0x00000000
#define _C1RXM0EID_EID0_MASK                     0x00000001
#define _C1RXM0EID_EID0_LENGTH                   0x00000001

#define _C1RXM0EID_EID1_POSITION                 0x00000001
#define _C1RXM0EID_EID1_MASK                     0x00000002
#define _C1RXM0EID_EID1_LENGTH                   0x00000001

#define _C1RXM0EID_EID2_POSITION                 0x00000002
#define _C1RXM0EID_EID2_MASK                     0x00000004
#define _C1RXM0EID_EID2_LENGTH                   0x00000001

