MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV32GM106/mcu.h
/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x200

#undef _FLASH_ROW
#define _FLASH_ROW 0x40

/*
 * Memory Segments Sizes
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x5580

#define __FSEC_BASE 0x5780
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x5790
#define __FBSLIM_LENGTH 0x2

#define __FOSCSEL_BASE 0x5798
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x579c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x57a0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x57a4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x57a8
#define __FICD_LENGTH 0x2

#define __FDMTINTVL_BASE 0x57ac
#define __FDMTINTVL_LENGTH 0x2

#define __FDMTINTVH_BASE 0x57b0
#define __FDMTINTVH_LENGTH 0x2

#define __FDMTCNTL_BASE 0x57b4
#define __FDMTCNTL_LENGTH 0x2

#define __FDMTCNTH_BASE 0x57b8
#define __FDMTCNTH_LENGTH 0x2

#define __FDMT_BASE 0x57bc
#define __FDMT_LENGTH 0x2

#define __FDEVOPT_BASE 0x57c0
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0x57c4
#define __FALTREG_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x1000

#define __YDATA_BASE 0x1800
#define __YDATA_LENGTH 0x1800
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x1000

#define __YDATA_BASE 0x1800
#define __YDATA_LENGTH 0x1800
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x1000

#define __YDATA_BASE 0x1800
#define __YDATA_LENGTH 0x1800

/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 1
#define _RPOUT_U2TX 3
#define _RPOUT_SDO2 8
#define _RPOUT_SCK2OUT 9
#define _RPOUT_SS2OUT 10
#define _RPOUT_C1TX 14
#define _RPOUT_OC1 16
#define _RPOUT_OC2 17
#define _RPOUT_OC3 18
#define _RPOUT_OC4 19
#define _RPOUT_C1OUT 24
#define _RPOUT_C2OUT 25
#define _RPOUT_C3OUT 26
#define _RPOUT_SYNCO1 45
#define _RPOUT_REFCLK 49
#define _RPOUT_C4OUT 50
#define _RPOUT_C5OUT 51
#define _RPOUT_SENT1 57
#define _RPOUT_SENT2 58

#endif
